#### Terraform Dev Plan 🧪
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.main.aws_dynamodb_table.error_cache will be created
  + resource "aws_dynamodb_table" "error_cache" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "errorKey"
      + id               = (known after apply)
      + name             = "zipcase-error-cache-dev"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "ZipCase Error Cache Table"
          + "Service"     = "AlertService"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "ZipCase Error Cache Table"
          + "Service"     = "AlertService"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "errorKey"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 3, in provider "aws":
   3:   version = "5.94.1"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
